GT2/RANS/notUsed/KEpsilon_highRE_V2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 1e-09;
internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }

    bottom
    {
        //type            fixedValue;
        //value           $internalField;
        //value           uniform 1e-12;

	//To use wall functions
        type	        kqRWallFunction;
	value           $internalField;
        //value           uniform 1e-09;
    }

    frontandback
    {
	type	empty;
    }
}

// ************************************************************************* //
